{
  "backend/main.mo": "Main Motoko actor defining the hospital management system with types for doctors, emergency cases, and user profiles, plus CRUD operations gated by role-based access control (admin, doctor, patient).",
  "feature_evidence.json": "Feature evidence report mapping implemented features (replacing fabricated stats with aspirational copy, comprehensive UI polish) to their affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for every frontend source file, describing the purpose and key details of each component, hook, and style file in the project.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML shell for the Vite/React app, setting the page title to 'Vitals AI', linking the PWA manifest, and mounting the React root.",
  "frontend/public/manifest.json": "PWA manifest for Vitals AI specifying app name, theme color, standalone display mode, and a 128×128 icon.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all six routes (/, /select-role, /portal-selection, /patient, /doctor, /admin), wraps the app in QueryClient and ThemeProvider, and renders a shared Layout with Header, Footer, and SupportButton.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Empty file placeholder for the AccessDeniedScreen component.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component displaying real-time stat cards (total/available doctors, open/critical cases) via React Query and tabbed Doctor Management and Case Management panels, with an optional readOnly prop.",
  "frontend/src/components/AdminPanel.tsx": "Empty file placeholder for the AdminPanel component.",
  "frontend/src/components/AdminPortal.tsx": "Renders an admin login form with passcode authentication (stored in sessionStorage) and, upon success, displays the AdminDashboard in read-only mode with a logout option.",
  "frontend/src/components/CaseManagement.tsx": "Displays a list of emergency cases with severity/status badges, allowing doctors to assign available doctors to cases or resolve them, with optional department filtering and read-only mode.",
  "frontend/src/components/DeploymentManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/DoctorManagement.tsx": "Provides a form to register new doctors (with a registration code gate) and lists all doctors with their availability status, allowing toggling of availability unless in read-only mode.",
  "frontend/src/components/DoctorPortal.tsx": "Implements a doctor-facing portal with login and registration tabs; once authenticated, shows the doctor's availability toggle and a filtered CaseManagement view for their department.",
  "frontend/src/components/EmergencySOS.tsx": "Empty file with no content or exports.",
  "frontend/src/components/EntryManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/FaucetManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with a mission CTA banner, department list, portal navigation links, core values, and contact/branding information.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with a teal info bar showing emergency contact info, a scrollable main nav with links, and a mobile hamburger menu. Handles smooth scrolling to page sections and navigation via TanStack Router.",
  "frontend/src/components/HomePage.tsx": "Full marketing homepage composed of multiple sections (Hero, Services, Doctors, etc.) using real doctor data from an API query. Includes department label/color helpers and animated UI elements.",
  "frontend/src/components/LandingPage.tsx": "Public-facing landing page with a hero section, feature highlights, and a 3-step onboarding flow. Directs unauthenticated users to the role selection page.",
  "frontend/src/components/MedicalReportAnalysis.tsx": "Empty file with no content.",
  "frontend/src/components/PatientPortal.tsx": "Patient portal with a registration form, SOS emergency case submission, and an embedded SymptomChecker tab. Uses React Query mutations to create emergency cases via the backend API.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/RoleSelector.tsx": "Role selection screen rendering three styled cards (Patient, Doctor, Admin) that navigate to their respective portals. Each card displays a feature list, gradient header, and a call-to-action button.",
  "frontend/src/components/SupportButton.tsx": "Floating support button fixed to the bottom-right corner that toggles a popover with a mailto link to the support email. Closes automatically when clicking outside.",
  "frontend/src/components/SymptomChecker.tsx": "A React component that accepts symptom text input and matches it against a rule-based keyword list to suggest medications, dosages, and notes for common conditions.",
  "frontend/src/components/TokenManagement.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the ICP backend actor, covering user profiles, doctors, cases, and error message formatting.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, defines CSS custom properties for light/dark themes using OKLCH colors, and declares utility animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Inter, Plus Jakarta Sans, JetBrains Mono), an extended color palette (teal, emerald, cyan in oklch), custom border radii, and box shadows for a premium hospital UI.",
  "project_state.json": "Project state tracking file (schema v1.0.0, version 3) describing a premium hospital website with aspirational messaging, listing architectural notes, image requirements, and implemented features such as replacing fabricated statistics and performing a comprehensive UI polish pass."
}