{
  "backend/main.mo": "Main Motoko actor defining types (Doctor, EmergencyCase, etc.) and all backend endpoints for user profiles, doctor registration (code '2011'), emergency cases, and medical suggestions, with role-based access control via AccessControl and MixinAuthorization mixins.",
  "backend/migration.mo": "Migration module that upgrades the persistent doctor records from OldDoctor (without registrationCode) to NewDoctor (with registrationCode defaulting to empty string) during canister upgrade.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (DoctorPortal registration with code '2011', AdminPortal with passcode '1107', SupportButton, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON document providing one-sentence summaries of every frontend source file, serving as a quick reference for build planning and code navigation.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the light and dark color themes including background, foreground, primary, destructive, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Vite app, setting the page title to 'Vitals AI', linking the PWA manifest, and mounting the React app into the #root div.",
  "frontend/public/manifest.json": "PWA manifest for Vitals AI defining app name, teal theme color, standalone display mode, and a 128×128 hospital logo icon.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for /, /select-role, /portal-selection, /patient, /doctor, and /admin, wraps everything in QueryClientProvider and ThemeProvider, and renders a Layout with Header, Footer, and SupportButton.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Empty file placeholder for the AccessDeniedScreen component.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays stat cards (total doctors, available doctors, open cases, critical cases) fetched via React Query and renders DoctorManagement and CaseManagement tabs, both accepting a readOnly prop.",
  "frontend/src/components/AdminPanel.tsx": "Empty file placeholder for the AdminPanel component.",
  "frontend/src/components/AdminPortal.tsx": "Provides a passcode-protected admin login screen (hardcoded passcode '1107') that, upon authentication, renders the AdminDashboard in read-only mode with a logout option.",
  "frontend/src/components/CaseManagement.tsx": "Displays and manages emergency cases with filtering, doctor assignment, and case resolution functionality, supporting an optional read-only mode and department-based filtering.",
  "frontend/src/components/DeploymentManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/DoctorManagement.tsx": "Renders a doctor registration form (with a hardcoded registration code '2011') and a list of all doctors with availability toggle, supporting an optional read-only mode.",
  "frontend/src/components/DoctorPortal.tsx": "Provides a doctor-facing portal with login and registration tabs; after authentication it shows the doctor's status, availability toggle, and their department-filtered CaseManagement view.",
  "frontend/src/components/EmergencySOS.tsx": "Empty file with no content or exports.",
  "frontend/src/components/EntryManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/FaucetManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with branding, portal navigation links, emergency contact info, and a HIPAA compliance note.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, desktop/mobile nav links, dark/light theme toggle, and a 'Get Started' button that routes to role selection.",
  "frontend/src/components/HomePage.tsx": "Marketing home page with a hero section, stats bar, and feature cards for Patient, Doctor, and Admin portals linking to their respective routes.",
  "frontend/src/components/LandingPage.tsx": "Alternative landing page component with hero, stats, feature cards, and a step-by-step 'how it works' section, using navigation hooks to route to role-specific portals.",
  "frontend/src/components/MedicalReportAnalysis.tsx": "Empty file with no content or exports.",
  "frontend/src/components/PatientPortal.tsx": "Patient portal with a registration form, emergency SOS submission form (backed by a mutation hook), and an embedded SymptomChecker tab.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content or exports.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty file with no content or exports.",
  "frontend/src/components/RoleSelector.tsx": "Role selection page displaying three clickable cards (Patient, Doctor, Admin) that navigate to their respective portals, with feature highlights per role.",
  "frontend/src/components/SupportButton.tsx": "Fixed floating support button that toggles a popover card with a mailto link to the support email address.",
  "frontend/src/components/SymptomChecker.tsx": "A React component that accepts symptom text input and matches it against a rule-based keyword list to suggest medications, dosages, and notes for common conditions.",
  "frontend/src/components/TokenManagement.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, doctors, and emergency cases, along with a friendly error message helper.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, custom CSS variables for light/dark themes, typography, and utility animations like SOS pulse, fade-in, and slide-up.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom oklch-based color palettes (teal, emerald, cyan), CSS variable-driven semantic colors, custom border radii, font families, box shadows, and keyframe animations.",
  "project_state.json": "Project state manifest describing a medical platform with role-based access (Admin code 1107, Doctor code 2011), listing existing features, architectural notes, and pending feature requests."
}