{
  "backend/main.mo": "Main Motoko actor defining the hospital management system with types for doctors, emergency cases, and medical suggestions, plus CRUD operations for doctor registration/login, case management, user profiles, and admin authorization via AccessControl mixin.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—AdminDashboard stat cards and useQueries.ts stat hooks—to their respective files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, and styles.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Vitals AI app, setting metadata, theme color, PWA manifest link, and mounting the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA manifest for Vitals AI defining app name, description, display mode, theme colors, and a 128x128 icon.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with six routes (/, /select-role, /portal-selection, /patient, /doctor, /admin), wraps the app in QueryClientProvider and ThemeProvider, and renders a shared Layout with Header, Footer, and SupportButton.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component that renders an access denied screen shown to unauthorized users attempting to reach restricted pages.",
  "frontend/src/components/AdminDashboard.tsx": "A comprehensive admin dashboard component with tabbed views for managing doctors and emergency cases, including stat cards, status/severity color helpers, and actions like toggling availability, updating case status, and assigning doctors.",
  "frontend/src/components/AdminPanel.tsx": "Empty file with no content or exports.",
  "frontend/src/components/AdminPortal.tsx": "A passcode-protected admin portal that gates access to the AdminDashboard component, using sessionStorage to persist authentication state with a hardcoded passcode.",
  "frontend/src/components/AIInsights.tsx": "React component displaying AI-generated health insight cards with mini bar charts, trend badges, and scores for cardiovascular, respiratory, blood pressure, and overall wellness metrics.",
  "frontend/src/components/CaseManagement.tsx": "Displays a searchable, filterable list of emergency cases fetched from the backend, separating them into emergency (critical/high) and regular categories with color-coded severity and status badges.",
  "frontend/src/components/DeploymentManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/DoctorManagement.tsx": "Provides a form to register new doctors with a registration code and lists existing doctors with the ability to toggle their availability, supporting an optional read-only mode.",
  "frontend/src/components/DoctorPortal.tsx": "A doctor-facing portal with login/registration flows and a dashboard showing department-specific cases, availability toggle, and emergency case highlights for the logged-in doctor.",
  "frontend/src/components/EmergencySOS.tsx": "Empty file with no content or exports.",
  "frontend/src/components/EntryManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/FaucetManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a vibrant CTA banner encouraging early adoption, brand info, department links, and contact details. Includes animated decorative elements and navigation via TanStack Router.",
  "frontend/src/components/Header.tsx": "Renders a fixed site header with a top info bar, scrollable navigation links, logo, and mobile menu. Handles smooth scrolling to page sections and navigation using TanStack Router.",
  "frontend/src/components/HomePage.tsx": "Composes the main public-facing home page with a hero section, services, stats, doctors listing, and contact sections. Fetches public doctor data and displays aspirational platform messaging.",
  "frontend/src/components/LandingPage.tsx": "A simpler alternative landing page highlighting key features (security, AI, multi-role), onboarding steps, and CTAs to get started or explore the platform.",
  "frontend/src/components/MedicalReportAnalysis.tsx": "Empty file with no content or exports.",
  "frontend/src/components/PatientPortal.tsx": "Provides a patient portal with a case registration form and a symptom checker tab, allowing patients to submit medical cases with department and severity selection.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content or exports.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty file with no content or exports.",
  "frontend/src/components/RoleSelector.tsx": "Renders a role selection landing page with three portal cards (Patient, Doctor, Admin), each with features, styling, and navigation to their respective routes.",
  "frontend/src/components/SmartAlerts.tsx": "Displays a filterable list of patient health alerts (critical, warning, normal) with demo data, severity-based styling, and time-ago timestamps.",
  "frontend/src/components/SupportButton.tsx": "A fixed floating button that toggles a popover with a support email link, closing when clicking outside.",
  "frontend/src/components/SymptomChecker.tsx": "A keyword-based symptom checker that matches user-entered symptoms against predefined rules and displays condition, medication, dosage, and notes suggestions.",
  "frontend/src/components/TokenManagement.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/components/VitalsDashboard.tsx": "Displays a real-time patient vitals dashboard with simulated heart rate, blood pressure, SpO2, and temperature readings, including sparkline charts and status indicators.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (user profiles, doctors, emergency cases) with error handling helpers and auto-refresh intervals.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS layers, defines CSS custom properties for light/dark themes, and declares animation keyframes and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom font families, a full brand color palette (teal, cyan, coral, rose, violet), and CSS variable-based semantic color tokens.",
  "project_state.json": "Project state manifest describing the Vitals AI healthcare app's current features, known issues, and pending feature requests focused on rebuilding a working admin portal with auto-refreshing stats."
}