{
  "backend/main.mo": "Main Motoko actor defining the hospital management system with types for doctors, emergency cases, and medical suggestions, plus CRUD operations for doctor registration/login, user profiles, emergency cases, and access-controlled admin functions.",
  "feature_evidence.json": "Feature evidence report mapping three doctor portal features (registration confirmation screen, post-registration redirect to login, and login-only dashboard access) to their implementing file and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, and styles.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the full design token system (colors, radius, chart, sidebar) in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the Vitals AI Vite/React app, setting metadata, theme color, PWA manifest link, and mounting the React root.",
  "frontend/public/manifest.json": "PWA web app manifest for Vitals AI defining app name, display mode, theme/background colors, and a 128×128 icon.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (/, /select-role, /portal-selection, /patient, /doctor, /admin), wraps the app in QueryClient and ThemeProvider, and renders a shared Layout with Header, Footer, and SupportButton.",
  "frontend/src/components/AccessDeniedScreen.tsx": "React component that displays an access-denied screen with a destructive-styled border for unauthorized users attempting to reach restricted routes.",
  "frontend/src/components/AdminDashboard.tsx": "A comprehensive admin dashboard component with tabs for managing doctors and emergency cases, displaying stat cards for totals and critical counts, and supporting actions like toggling availability, updating case status, assigning doctors, and deleting cases.",
  "frontend/src/components/AdminPanel.tsx": "Empty file with no content.",
  "frontend/src/components/AdminPortal.tsx": "A passcode-protected admin portal that gates access to the AdminDashboard component, using sessionStorage to persist authentication and a hardcoded passcode ('1107') for login.",
  "frontend/src/components/AIInsights.tsx": "React component rendering a set of AI-generated health insight cards with mini bar charts, trend badges, and scores for cardiovascular, respiratory, blood pressure, and overall wellness metrics.",
  "frontend/src/components/CaseManagement.tsx": "A read-only case management component that fetches and displays emergency cases with search filtering, separating critical/high severity cases from regular ones and supporting optional department filtering.",
  "frontend/src/components/DeploymentManagement.tsx": "Empty file with no content.",
  "frontend/src/components/DoctorManagement.tsx": "A doctor management component that provides a registration form (with a hardcoded registration code '2011') and lists existing doctors with the ability to toggle their availability status.",
  "frontend/src/components/DoctorPortal.tsx": "A doctor-facing portal supporting registration and login by doctor ID, displaying assigned cases with severity/status badges, availability toggling, and a credentials modal shown after successful registration.",
  "frontend/src/components/EmergencySOS.tsx": "Empty file with no content.",
  "frontend/src/components/EntryManagement.tsx": "Empty file with no content.",
  "frontend/src/components/FaucetManagement.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a vibrant CTA banner encouraging early adoption, plus a multi-column grid with brand info, department links, and contact details.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with a top info bar, scrollable nav links, logo, and mobile menu toggle using TanStack Router for navigation.",
  "frontend/src/components/HomePage.tsx": "Full marketing homepage composed of multiple sections including an animated hero, services, doctors listing (fetched via query), stats, and a contact section.",
  "frontend/src/components/LandingPage.tsx": "Simpler landing page with a hero section, feature cards (Safe, AI-Powered, Built for Everyone), and a step-by-step onboarding guide, navigating users to role selection.",
  "frontend/src/components/MedicalReportAnalysis.tsx": "Empty file with no content or exports.",
  "frontend/src/components/PatientPortal.tsx": "Patient portal with a tabbed interface offering a case registration form (submitting department, severity, and symptoms) and an embedded SymptomChecker component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content or exports.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty file with no content or exports.",
  "frontend/src/components/RoleSelector.tsx": "Renders a role selection landing page with three portal cards (Patient, Doctor, Admin), each with features, styling, and navigation to their respective routes.",
  "frontend/src/components/SmartAlerts.tsx": "Displays a filterable list of patient health alerts (critical, warning, normal) with demo data, severity-based styling, and time-ago timestamps.",
  "frontend/src/components/SupportButton.tsx": "A fixed floating button that toggles a popover with a customer support email link, closing when clicking outside.",
  "frontend/src/components/SymptomChecker.tsx": "A keyword-based AI symptom checker that matches user-entered symptoms against predefined rules and suggests medications, dosages, and notes.",
  "frontend/src/components/TokenManagement.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/components/VitalsDashboard.tsx": "Displays a real-time patient vitals dashboard with simulated heart rate, blood pressure, SpO2, and temperature readings, including sparkline charts and status indicators.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous Internet Computer actor using TanStack Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend interactions including user profiles, doctor registration, approval, and emergency case management.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS with custom CSS variables for light/dark themes, brand color tokens, and defines animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom font families, a full brand color palette (teal, cyan, coral, rose, violet), and CSS variable-based semantic color mappings.",
  "project_state.json": "Project state metadata describing the current fix request: after doctor registration, show credentials in a confirmation screen then redirect to the login page instead of the dashboard."
}