{
  "kind": "build_request",
  "title": "Fix doctor registration flow to show credentials before redirecting to login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "After a doctor successfully completes registration, display their generated Registration ID and Code in a confirmation screen or modal so they can save them before proceeding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14",
          "msg-16"
        ],
        "quotes": [
          "when we register as a doctor we have to get our registration id and code and then we have to click on login",
          "it is just throwing up to the doctors dashboard after registration"
        ]
      },
      "acceptanceCriteria": [
        "After submitting the registration form, the doctor sees a confirmation screen showing their Registration ID and Code clearly.",
        "The confirmation screen includes a copy or 'I have saved these credentials' acknowledgement button.",
        "The Registration ID and Code are visually prominent and easy to read/copy."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After the doctor acknowledges their credentials on the confirmation screen, redirect them to the login page (not the dashboard). Remove any automatic post-registration redirect to the doctor dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14",
          "msg-16"
        ],
        "quotes": [
          "it is just throwing up to the doctors dashboard after registration",
          "The dashboard should only be accessible after they explicitly log in using their registration credentials"
        ]
      },
      "acceptanceCriteria": [
        "After acknowledging credentials, the doctor is redirected to the DoctorPortal login form.",
        "The doctor dashboard is NOT shown immediately after registration.",
        "The doctor can only access the dashboard after successfully logging in with their Registration ID and Code."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the DoctorPortal login form is the only entry point to the doctor dashboard. If a doctor navigates to the doctor route without an active login session, they must see the login form, not the dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "The dashboard should only be accessible after they explicitly log in using their registration credentials"
        ]
      },
      "acceptanceCriteria": [
        "Accessing the /doctor route without a logged-in doctor session displays the login form.",
        "The doctor dashboard is only rendered when a valid doctor session (registration ID + code authenticated) is present."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend registration logic or the generated Registration ID/Code format.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Changing the registration form fields or backend data model.",
    "Adding email or SMS delivery of credentials.",
    "Modifying the admin or patient portal flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}