{
  "kind": "build_request",
  "title": "Premium Hospital Website — Aspirational Messaging & UI Polish",
  "projectName": "Vitals AI Hospital",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace all inflated or fabricated statistics (e.g., 'Trusted by 10,000+ patients', specific patient count claims) with honest, aspirational, mission-driven copy throughout the homepage, hero section, stats bar, and footer. Use forward-looking language such as 'Our mission is to be trusted by every patient, everywhere', 'Committed to delivering pure and proper healthcare to the world', 'Aspiring to set the global standard in patient care', and 'Built on the promise of world-class health facilities for all'. Remove any numeric claim that cannot be verified; replace with vision statements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "we are not here to make false promises so please don't write trusted by 10000 + patients write the realistic type of thing",
          "will be trusted by the whole world aspirational you get it"
        ]
      },
      "acceptanceCriteria": [
        "No fabricated numeric statistics (patient counts, satisfaction percentages, etc.) appear anywhere on the site",
        "Hero and stats sections contain aspirational, forward-looking mission statements instead",
        "All copy reads as authentic and honest without inflated claims",
        "Aspirational language is consistent in tone across homepage, hero, stats bar, departments section, and footer"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Perform a comprehensive UI polish pass across all pages and components (HomePage, Header, Footer, hero section, stats bar, departments section, doctor showcase, LandingPage, RoleSelector). Improvements must include: (1) tighter, more intentional spacing and padding with consistent vertical rhythm; (2) refined typography — stronger visual hierarchy with clear heading scales, improved line-height and letter-spacing for readability; (3) elevated visual hierarchy so the most important content commands attention immediately; (4) premium card and section styling with subtle depth (shadows, borders, glassmorphism where appropriate); (5) smooth, tasteful animations and micro-interactions on scroll and hover; (6) cohesive color usage leveraging the existing teal/emerald/cyan palette defined in tailwind.config.js with proper contrast ratios; (7) a fully polished mobile layout with responsive breakpoints.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "about the ui it's awesome now , I leave it all on you , if you think any changes has to be made to make it more better and the best then please do help me",
          "tightening spacing, refining typography, improving visual hierarchy, and making sure the overall feel is truly premium and professional"
        ]
      },
      "acceptanceCriteria": [
        "Spacing and padding are consistent and intentional across all sections",
        "Typography hierarchy is clear: H1 > H2 > H3 > body with appropriate scale and weight",
        "Cards, sections, and interactive elements have premium styling with depth and polish",
        "Hover and scroll animations are smooth and purposeful without being distracting",
        "Color palette is cohesive using the teal/emerald/cyan theme throughout",
        "Layout is fully responsive and looks premium on mobile, tablet, and desktop"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Redesign the hero section of the HomePage to be visually striking and aspirational. It should feature a bold, full-width layout with a strong headline communicating the hospital's world-class mission, a compelling subheadline with honest mission-driven copy, a prominent call-to-action button, and a high-quality visual element (gradient background, abstract medical imagery, or animated visual). The hero must immediately communicate trust, professionalism, and global ambition.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "giving pure and proper health facilities",
          "make it the best"
        ]
      },
      "acceptanceCriteria": [
        "Hero section spans full viewport width with a premium visual design",
        "Headline clearly communicates the hospital's aspirational, world-class mission",
        "No false statistics or unverified claims appear in the hero",
        "Call-to-action button is prominent and visually appealing",
        "Hero looks outstanding on all screen sizes"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enhance the Footer component with refined layout, consistent branding, and honest mission-driven messaging. Replace any boilerplate or inflated claims with the hospital's core values: pure healthcare, proper facilities, and global aspiration. Include a brief mission statement tagline in the footer. Ensure the footer has premium spacing, proper visual separation, and is fully responsive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "giving pure and proper health facilities",
          "will be trusted by the whole world aspirational"
        ]
      },
      "acceptanceCriteria": [
        "Footer contains a concise, honest mission statement or tagline",
        "No inflated statistics or false claims appear in the footer",
        "Footer layout is clean, well-spaced, and visually consistent with the rest of the site",
        "Footer is fully responsive across all breakpoints"
      ]
    }
  ],
  "constraints": [
    "Do not fabricate or include any unverifiable statistics, patient counts, or satisfaction numbers",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Do not alter backend logic or data models — this is a frontend-only change",
    "Preserve the existing teal/emerald/cyan color palette defined in tailwind.config.js"
  ],
  "nonGoals": [
    "Adding new backend features or data models",
    "Implementing live appointment booking",
    "Adding new portal pages or routes",
    "Changing the authentication system",
    "Adding real patient data or testimonials"
  ],
  "imageRequirements": {
    "required": [
      "Premium abstract medical hero background with soft teal and emerald gradient blending into deep navy, subtle geometric medical cross patterns, clean and aspirational (hero-bg.dim_1920x1080.png)",
      "Elegant abstract world globe illustration with teal circuit-line connections suggesting global healthcare reach, minimal flat style on transparent background (global-reach.dim_800x800.png)"
    ],
    "edits": []
  }
}