{
  "kind": "build_request",
  "title": "Fix Admin Portal with Working Auto-Refreshing Stats Dashboard",
  "projectName": "Vitals AI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expose backend query functions that return accurate counts for: total number of registered doctors, total number of emergency cases, and total number of active/critical emergencies. These must be callable without authentication so the admin dashboard can poll them reliably.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "make an admin portal where the real time, total doctors, cases and emergencies are showed"
        ]
      },
      "acceptanceCriteria": [
        "A query function returns the total count of doctors in the system",
        "A query function returns the total count of all cases",
        "A query function returns the total count of emergency/critical cases",
        "All three functions return correct, up-to-date values reflecting the current state"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Rewrite the AdminDashboard component to prominently display three stat cards: Total Doctors, Total Cases, and Total Emergencies. Each card must show the live count fetched from the backend. The dashboard must auto-refresh all three stats every 5 seconds using React Query's refetchInterval so the numbers stay current without manual page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "make an admin portal where the real time, total doctors, cases and emergencies are showed",
          "keep the ui unchanged"
        ]
      },
      "acceptanceCriteria": [
        "Three stat cards are visible on the admin dashboard: Total Doctors, Total Cases, Total Emergencies",
        "Each card displays the correct count fetched from the backend",
        "Stats automatically refresh every 5 seconds without user interaction",
        "A loading state is shown while data is being fetched on first load",
        "An error state is shown gracefully if the backend call fails",
        "The overall page layout, color scheme, typography, and existing UI elements outside the stats section remain visually unchanged"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the AdminPortal passcode gate (in AdminPortal.tsx) correctly renders AdminDashboard after successful authentication. The passcode login form must function end-to-end: entering the correct passcode grants access and displays the working stats dashboard; the logout button clears the session and returns to the login screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "Nothing in the admin dashboard is working"
        ]
      },
      "acceptanceCriteria": [
        "Entering the correct admin passcode displays the AdminDashboard with stats",
        "Entering an incorrect passcode shows an error and blocks access",
        "The Logout button clears sessionStorage and returns to the passcode screen",
        "No blank screen or silent failure occurs at any step of the admin portal flow"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add or update React Query hooks in useQueries.ts to support fetching the three admin stat counts (total doctors, total cases, total emergencies) with a 5-second refetchInterval. These hooks must handle errors gracefully and return sensible defaults (e.g., 0) when data is unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "make it work please make it work"
        ]
      },
      "acceptanceCriteria": [
        "Three React Query hooks exist for fetching doctor count, case count, and emergency count",
        "Each hook uses refetchInterval of 5000ms",
        "Hooks return 0 as default when data is not yet loaded or an error occurs",
        "Hooks are consumed correctly by AdminDashboard"
      ]
    }
  ],
  "constraints": [
    "Do not alter the existing UI layout, color scheme, typography, or any component outside the admin portal stats section",
    "Do not use WebSockets — use polling (React Query refetchInterval) for auto-refresh",
    "Do not modify immutable frontend paths: useInternetIdentity.ts, useActor.ts, main.tsx, or components/ui"
  ],
  "nonGoals": [
    "Adding new admin actions such as adding/removing doctors or updating case statuses",
    "Redesigning any page outside the admin dashboard stats area",
    "Implementing a new authentication system — existing passcode gate in AdminPortal.tsx is sufficient",
    "Any changes to the patient portal or doctor portal"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}