{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix doctor registration flow to show credentials before redirecting to login",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display doctor credentials (Registration ID and Code) on a confirmation screen after successful registration before allowing user to proceed",
      "acceptanceCriteria": [
        "After submitting the registration form, the doctor sees a confirmation screen showing their Registration ID and Code clearly.",
        "The confirmation screen includes a copy or 'I have saved these credentials' acknowledgement button.",
        "The Registration ID and Code are visually prominent and easy to read/copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoctorCredentialsModal.tsx",
          "operation": "create",
          "description": "Create a modal component that displays the doctor's Registration ID and Code in a visually prominent confirmation screen. Include copy-to-clipboard functionality for both credentials, a visual acknowledgement checkbox/button ('I have saved these credentials'), and a primary action button to proceed to login. Use shadcn/ui Dialog component for consistent styling. The modal should not be dismissible until the user explicitly acknowledges."
        },
        {
          "path": "frontend/src/components/DoctorPortal.tsx",
          "operation": "modify",
          "description": "Modify the doctor registration flow to show the DoctorCredentialsModal immediately after successful registration instead of auto-redirecting to the dashboard. Store the newly registered doctor's ID and code in component state after registration mutation succeeds, trigger the credentials modal, and only navigate to login after the user acknowledges in the modal. Remove any automatic dashboard navigation after registration. Ensure the registration form is hidden while the credentials modal is displayed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Redirect doctor to login page after credentials acknowledgement, removing automatic post-registration dashboard access",
      "acceptanceCriteria": [
        "After acknowledging credentials, the doctor is redirected to the DoctorPortal login form.",
        "The doctor dashboard is NOT shown immediately after registration.",
        "The doctor can only access the dashboard after successfully logging in with their Registration ID and Code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoctorPortal.tsx",
          "operation": "modify",
          "description": "Update the credentials modal acknowledgement handler to navigate to the login view (set activeView to 'login') instead of the dashboard. Clear any temporary registration state and ensure loggedInDoctor remains null until explicit login via doctorLogin mutation succeeds. Remove any code that sets loggedInDoctor immediately after registration."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure DoctorPortal login form is the only entry point to dashboard; prevent dashboard access without active login session",
      "acceptanceCriteria": [
        "Accessing the /doctor route without a logged-in doctor session displays the login form.",
        "The doctor dashboard is only rendered when a valid doctor session (registration ID + code authenticated) is present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoctorPortal.tsx",
          "operation": "modify",
          "description": "Add session validation logic when the component mounts or when navigating to /doctor route. Check if loggedInDoctor state exists; if not, force activeView to 'login'. Ensure the dashboard view is only rendered when loggedInDoctor is not null. Clear loggedInDoctor state on any logout or when leaving the portal. Add defensive checks so that any attempt to render the dashboard without loggedInDoctor falls back to the login view."
        }
      ]
    }
  ]
}