{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Healthcare app with an admin portal showing real-time (auto-refreshing) stats: Total Doctors, Total Cases, and Total Emergencies. Existing UI must remain unchanged.",
  "architectural_notes": [
    "Admin portal stats must auto-refresh every few seconds (no WebSocket support)",
    "Existing UI must remain unchanged — only the admin portal section is being rebuilt"
  ],
  "known_issues": [
    "Admin dashboard (version 37) was completely non-functional — all features broken"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-rewrite-the-admindashboard-component-to-prominently-display-three-stat-cards-total-doctors-total-cases-and-total-emergencies-each-card-must-show-the-live-count-fetched-from-the-backend-the-dashboard-must-auto-refresh-all-three-stats-every-5-seconds-using-react-query-s-refetchinterval-so-the-numbers-stay-current-without-manual-page-reload",
      "title": "Rewrite the AdminDashboard component to prominently display three stat cards: Total Doctors, Total Cases, and Total Emergencies. Each card must show the live count fetched from the backend. The dashboard must auto-refresh all three stats every 5 seconds using React Query's refetchInterval so the numbers stay current without manual page reload.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-or-update-react-query-hooks-in-usequeries-ts-to-support-fetching-the-three-admin-stat-counts-total-doctors-total-cases-total-emergencies-with-a-5-second-refetchinterval-these-hooks-must-handle-errors-gracefully-and-return-sensible-defaults-e-g-0-when-data-is-unavailable",
      "title": "Add or update React Query hooks in useQueries.ts to support fetching the three admin stat counts (total doctors, total cases, total emergencies) with a 5-second refetchInterval. These hooks must handle errors gracefully and return sensible defaults (e.g., 0) when data is unavailable.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Working admin portal with auto-refreshing stats: Total Doctors, Total Cases, Total Emergencies",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Expose backend query functions that return accurate counts for: total number of registered doctors, total number of emergency cases, and total number of active/critical emergencies. These must be callable without authentication so the admin dashboard can poll them reliably.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Ensure the AdminPortal passcode gate (in AdminPortal.tsx) correctly renders AdminDashboard after successful authentication. The passcode login form must function end-to-end: entering the correct passcode grants access and displays the working stats dashboard; the logout button clears the session and returns to the login screen.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Vitals AI",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}