{
  "backend/main.mo": "Main actor implementing a hospital emergency management system with patient, emergency case, doctor, and case assignment management, including role-based access control and data migration support.",
  "backend/migration.mo": "Migration module that transforms old blockchain-focused actor state (admins, entries, deployments, faucets, tokens, transactions) into new hospital management state (patients, emergencies, doctors, case assignments, user profiles).",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for hospital emergency management including admin authentication, case dashboard, doctor management, department selection, and UI replacement from blockchain to hospital interface.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing hospital emergency system UI including emergency SOS form, admin dashboard, case/doctor management, authentication hooks, and styling with medical blue theme.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode themes using medical blue color scheme for hospital management interface.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React app component with hospital hero section, emergency SOS form for all users, and tabbed interface showing admin dashboard only to authenticated admins with profile setup modal for new users.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displayed to non-admin users attempting to access admin dashboard, with messaging directing them to public emergency form.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard wrapper component with role-based access control that displays tabbed interface for case and doctor management or shows access denied screen for non-admins.",
  "frontend/src/components/AdminPanel.tsx": "Empty file with no content.",
  "frontend/src/components/CaseManagement.tsx": "Displays and manages emergency cases with filtering by status and department, allowing admins to assign doctors to cases via a table interface.",
  "frontend/src/components/DeploymentManagement.tsx": "Empty file with no content.",
  "frontend/src/components/DoctorManagement.tsx": "Manages doctors organized by department with functionality to add new doctors and view them in an accordion grouped by department.",
  "frontend/src/components/EmergencySOS.tsx": "Form component for submitting emergency cases with patient information, address, description, and department selection.",
  "frontend/src/components/EntryManagement.tsx": "Empty file with no content.",
  "frontend/src/components/FaucetManagement.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Displays copyright information and a link to caffeine.ai with branding.",
  "frontend/src/components/Header.tsx": "Navigation header with app branding, user profile display, admin badge, theme toggle, and login/logout functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name to complete profile setup on first login.",
  "frontend/src/components/TokenManagement.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating queries on identity changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that checks if the current caller has admin privileges by querying the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and context provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including user profiles, patients, emergencies, doctors, case assignments, and departments with mutation handling and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark mode) using OKLCH color space for UI components like cards, buttons, charts, and sidebar.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining a hospital management system requiring fixes to non-functional features, admin dashboard for case management, department-based doctor assignments, and emergency SOS routing."
}