{
  "backend/main.mo": "Main Motoko actor implementing a hospital management system with patient, emergency, doctor, and case assignment management, plus role-based access control with admin initialization and user profile management.",
  "feature_evidence.json": "Feature evidence report documenting implemented PWA manifest, QR code generator component, and admin dashboard integration with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their functionality, styling (teal theme, flashy borders), and UI patterns including authentication, role-based navigation, and management interfaces.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light/dark themes, custom card utilities (card-enhanced, card-glow), and animation keyframes for micro-interactions.",
  "frontend/index.html": "HTML entry point with PWA manifest link, teal theme color meta tag, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining Vitals AI app metadata with teal theme color, standalone display mode, and icon array for mobile installation.",
  "frontend/src/App.tsx": "Root React component with QueryClient provider, theme provider, role-based routing (patient/doctor/admin portals), authentication handling, profile setup modal, and persistent support button.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a shield alert icon and error message with destructive border styling for unauthorized portal access attempts.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard with three-tab interface (Emergency Cases, Doctors, QR Code) integrating CaseManagement, DoctorManagement, and QRCodeGenerator components with admin URL.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component for managing admin users with invitation code creation and verification functionality.",
  "frontend/src/components/AdminPortal.tsx": "Admin authentication component that displays a code entry form (hardcoded code '2011') and renders the AdminDashboard upon successful authentication.",
  "frontend/src/components/CaseManagement.tsx": "Emergency case management interface with filtering by status and department, displaying cases in a table with doctor assignment functionality.",
  "frontend/src/components/DeploymentManagement.tsx": "Empty file with no content.",
  "frontend/src/components/DoctorManagement.tsx": "Component for adding and managing doctors, displaying them grouped by department in an accordion layout with case assignment tracking.",
  "frontend/src/components/DoctorPortal.tsx": "Doctor portal that shows a registration form for authenticated users without a doctor profile, then provides access to medical report analysis and assigned emergency cases.",
  "frontend/src/components/EmergencySOS.tsx": "Emergency submission form that collects patient information, location, description, and department selection to create new emergency cases.",
  "frontend/src/components/EntryManagement.tsx": "Empty file with no content.",
  "frontend/src/components/FaucetManagement.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Application footer displaying copyright information and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "Application header component displaying branding, user profile, role badges, theme toggle, and authentication controls (login/logout). Includes navigation back to home and admin badge display.",
  "frontend/src/components/MedicalReportAnalysis.tsx": "Component for analyzing medical reports using AI, featuring a text input form and displaying analysis results with severity classification and key findings badges.",
  "frontend/src/components/PatientPortal.tsx": "Patient-facing portal with tabbed interface providing access to Emergency SOS and Symptom Checker features.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, prompting users to enter their name before accessing the application.",
  "frontend/src/components/QRCodeGenerator.tsx": "Generates and displays QR codes for admin portal access using the qrcode.js library loaded from CDN, with download functionality.",
  "frontend/src/components/RoleSelector.tsx": "Landing page component displaying Vitals AI branding, key features, statistics, and role selection cards for patient, doctor, and admin access.",
  "frontend/src/components/SupportButton.tsx": "Floating support button with modal dialog displaying support email contact information, including copy-to-clipboard and mailto functionality.",
  "frontend/src/components/SymptomChecker.tsx": "React component that provides an AI-powered symptom analysis form with textarea input, displays diagnosis results with severity badges, and shows recommendations and next steps.",
  "frontend/src/components/TokenManagement.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionList.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creates actors based on Internet Identity state, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Custom hook that checks if the current caller is an admin by querying the backend actor, with authentication and loading state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, admin/doctor registration, patient management, and emergency handling with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, enhanced card styles, and animation utilities including fade-in, slide-in, and scale-in effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom spacing, typography, border radius utilities, box shadows with glow effects, and accordion animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document defining a hospital management system with role-based access (Patient/Doctor/Admin), AI-powered medical analysis (Vitals AI), emergency SOS, doctor allocation, and Flipkart-inspired UI. Specifies home page should show only 'Get Started' button, admin uses Internet Identity authentication, and includes customer support contact fixed to bottom-right corner."
}