{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PWA capabilities and QR code feature to admin portal",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Create PWA manifest.json with app metadata and teal theme",
      "acceptanceCriteria": [
        "manifest.json file exists in frontend/public directory",
        "Manifest includes all required PWA fields (name, short_name, description, theme_color, background_color, display, icons)",
        "Theme color uses the teal color from the existing design (#14b8a6 or similar)",
        "Display mode is set to 'standalone' for app-like experience"
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "create",
          "description": "Create PWA manifest file with app name 'Vitals AI', short_name 'Vitals AI', description for healthcare management, theme_color '#14b8a6' (teal), background_color '#ffffff', display 'standalone', and icons array referencing the generated admin-icon.dim_48x48.png, doctor-avatar.dim_128x128.png, and emergency-icon.dim_64x64.png from frontend/public/assets/generated/ with appropriate sizes (48x48, 128x128, 192x192, 512x512). Include start_url and scope fields for proper PWA functionality."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Add manifest link tag to index.html for PWA installation",
      "acceptanceCriteria": [
        "index.html includes <link rel='manifest' href='/manifest.json'> in the head section",
        "Mobile browsers can detect and prompt users to install the app"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add <link rel='manifest' href='/manifest.json'> tag inside the <head> section to enable PWA installation prompts on mobile devices. Also add theme-color meta tag with value '#14b8a6' for browser chrome theming."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Create QRCodeGenerator component with display and download functionality",
      "acceptanceCriteria": [
        "QRCodeGenerator component displays a QR code that encodes the exact URL provided",
        "Component includes a download button that saves the QR code as a PNG image file",
        "QR code is displayed in a card with teal borders matching the existing design theme",
        "Download functionality works correctly in all modern browsers",
        "Component styling is consistent with other admin portal components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QRCodeGenerator.tsx",
          "operation": "create",
          "description": "Create a React component that generates a QR code for the exact URL 'https://vitals-ai-featuringsmarthospitals-jrg.caffeine.xyz/#caffeineAdminToken=caf86f15a219649b9883aca3e42d0418f6e4682726fd4227e005e7f46af65497'. Use a QR code library (e.g., qrcode.react or react-qr-code) to generate the code. Display it in a card with teal border styling (border-primary) matching the Flipkart-inspired design. Include a download button that converts the QR code to a PNG image using canvas.toDataURL() and triggers a download with a descriptive filename like 'vitals-ai-admin-qr.png'. Add a clear section title like 'Admin Access QR Code' and optional description text. Use shadcn/ui Card, Button components for consistent styling with the rest of the admin portal."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Integrate QRCodeGenerator into AdminDashboard component",
      "acceptanceCriteria": [
        "QRCodeGenerator component is imported and rendered within AdminDashboard",
        "QR code section is clearly labeled (e.g., 'Admin Access QR Code' or 'Share Admin Portal')",
        "QR code is only visible to users who have successfully authenticated to the admin portal",
        "Layout integrates smoothly with existing admin dashboard sections without breaking the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Import and add the QRCodeGenerator component to the AdminDashboard. Position it prominently, either as a new tab in the existing Tabs interface alongside 'Emergency Cases' and 'Doctors', or as a dedicated card section above or below the tabbed content. Ensure it's clearly labeled and visually consistent with the existing teal-themed admin interface. The QR code will only be accessible to authenticated admin users since AdminDashboard is already protected by the AdminPortal authentication flow."
        }
      ]
    }
  ]
}